openfoam/run/taylor_green_re200/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   nonuniform List<vector>
4096
(
(0.0490085702 -0.0490085702 0)
(0.0485365908 -0.1465537312 0)
(0.0475971776 -0.2426874996 0)
(0.0461993776 -0.3364840548 0)
(0.0443566522 -0.4270400846 0)
(0.0420867481 -0.5134834849 0)
(0.0394115256 -0.5949817586 0)
(0.0363567485 -0.6707500327 0)
...
)
;

boundaryField
{
    left        { type cyclic; }
    right       { type cyclic; }
    top         { type cyclic; }
    bottom      { type cyclic; }
    frontAndBack { type empty; }
}
