openfoam/run/taylor_green_re200/constant/momentumTransport
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}

simulationType laminar;
