openfoam/run/taylor_green_re200/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; location "system"; object blockMeshDict; }

scale 1;

// Domain: [0, 2*pi]^3
vertices
(
    (0          0          0         )
    (6.2832     0          0         )
    (6.2832     6.2832     0         )
    (0          6.2832     0         )
    (0          0          6.2832    )
    (6.2832     0          6.2832    )
    (6.2832     6.2832     6.2832    )
    (0          6.2832     6.2832    )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (64 64 1) simpleGrading (1 1 1)
);

boundary
(
    top         { type cyclic; neighbourPatch bottom; faces ((3 7 6 2)); }
    bottom      { type cyclic; neighbourPatch top;    faces ((0 4 5 1)); }
    left        { type cyclic; neighbourPatch right;  faces ((0 3 7 4)); }
    right       { type cyclic; neighbourPatch left;   faces ((1 2 6 5)); }
    frontAndBack { type empty; faces ((0 1 2 3) (4 5 6 7)); }
);
